Public Member Functions | List of all members
ACAPI::MEP::Terminal::Modifier Class Reference
MEP Element Manager
Modifier of the Terminal. More...
#include <MEPTerminal.hpp>
 Inheritance diagram for ACAPI::MEP::Terminal::Modifier:
 Public Member Functions
Result< void >  | Inject (const TerminalDefault &terminalDefault)
Injects the Default settings into the Terminal.
 Public Member Functions inherited from ACAPI::MEP::ModifiableElementBase::Modifier
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ModifiableElementBase::Modifier
Modifier (ModifiableElementBase &parent)
Constructs a Modifier with the parent ModifiableElementBase.
 void  | FinalizeModification () override
Finalizes the modifications.
Detailed Description
Modifier of the Terminal.
Member Function Documentation
◆ Inject()
 Result< void > ACAPI::MEP::Terminal::Modifier::Inject  |  ( |  const TerminalDefault & |  terminalDefault | )
Injects the Default settings into the Terminal.
Parameters
terminalDefault | The Default what will be injected. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.